

export const EmotionFmt = {
  "c": "平静",
  "愉快": "愉悦",
  "h": "愉悦",
  "j": "愉悦",
  "f": "恐惧",
  "s": "恐惧",
  "p": "痛苦",
  "e": "激昂"
}

export const HelpDoc =`本扩展是适用于《Starlight繁星物语》规则的规则扩展。
当前版本：2.0.0

指令列表：
- /st [技能描述] [共情面] ... ：设置角色气质
 - /st show : 展示角色共情面和对应特长
- /emo [情绪] :设置角色情绪
- /en [值] : 设置角色能量
- /sl [使用特长] ... [修正值] : 进行检定
- /hurt [目标面值] [创伤描述] ... : 使用创伤覆盖指定面
- /heal [目标面值] ... : 使用恢复指定面
- /cp [@目标角色] [该角色的共情面] [要覆盖的面(默认值为上一项的值)] : 使用创伤覆盖指定面
- /sn sl：设置starlight格式的角色名片

感谢您的使用！
bug反馈&建议：sheyiyuantan90@qq.com`
